Autodesk.Revit.DB.DirectShapeTargetViewType
View types for which DirectShape objects are allowed to have alternative shape representations
Since:
2015
View types for which DirectShape objects are allowed to have alternative shape representations. Currently limited to Plan Views.
Since:
2015

Autodesk.Revit.DB.DirectShapeTargetViewType.Plan
The alternate representation will be used only in Revit Plan views

Autodesk.Revit.DB.DirectShapeTargetViewType.Default
Shape to be used in all views for which a view-specific shape was not provided

Autodesk.Revit.DB.DirectShapeTargetViewType.Undefined
Invalid value